{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_filter": 32, "name": "convolution2d_1", "activation": "relu", "activity_regularizer": null, "bias": true, "input_dtype": "float32", "trainable": true, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "batch_input_shape": [null, 128, 128, 4], "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "activation": "relu", "nb_filter": 32, "name": "convolution2d_2", "subsample": [1, 1], "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "activation": "relu", "nb_filter": 32, "name": "convolution2d_3", "subsample": [1, 1], "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "b_constraint": null, "input_dim": 6272, "activation": "sigmoid", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "output_dim": 1024}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "b_constraint": null, "input_dim": 1024, "activation": "sigmoid", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "output_dim": 256}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "b_regularizer": null, "b_constraint": null, "input_dim": 256, "activation": "sigmoid", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "output_dim": 64}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "b_regularizer": null, "b_constraint": null, "input_dim": 64, "activation": "softmax", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "output_dim": 5}}], "keras_version": "1.2.2"}