{"keras_version": "1.2.2", "config": [{"config": {"trainable": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "input_dtype": "float32", "b_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 128, 128, 4], "activity_regularizer": null, "activation": "relu", "bias": true, "name": "convolution2d_1", "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "name": "convolution2d_2", "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "name": "convolution2d_3", "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 6272, "output_dim": 1024, "activity_regularizer": null, "bias": true, "name": "dense_1", "W_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 1024, "output_dim": 256, "activity_regularizer": null, "bias": true, "name": "dense_2", "W_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 256, "output_dim": 64, "activity_regularizer": null, "bias": true, "name": "dense_3", "W_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 64, "output_dim": 5, "activity_regularizer": null, "bias": true, "name": "dense_4", "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}