{"config": [{"config": {"nb_filter": 32, "nb_col": 3, "subsample": [1, 1], "batch_input_shape": [null, 128, 128, 4], "trainable": true, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "name": "convolution2d_1", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 32, "nb_col": 3, "subsample": [1, 1], "trainable": true, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 32, "nb_col": 3, "subsample": [1, 1], "trainable": true, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "sigmoid", "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 6272, "name": "dense_1", "output_dim": 1024, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 1024, "name": "dense_2", "output_dim": 256, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 256, "name": "dense_3", "output_dim": 64, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 64, "name": "dense_4", "output_dim": 4, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}