{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "border_mode": "valid", "batch_input_shape": [null, 128, 128, 4], "activation": "relu", "activity_regularizer": null, "nb_filter": 32, "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "input_dtype": "float32", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "nb_filter": 32, "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "nb_filter": 32, "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_1", "b_constraint": null, "input_dim": 6272, "output_dim": 1024}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_2", "b_constraint": null, "input_dim": 1024, "output_dim": 256}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_3", "b_constraint": null, "input_dim": 256, "output_dim": 64}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "activation": "softmax", "name": "dense_4", "b_constraint": null, "input_dim": 64, "output_dim": 6}}], "keras_version": "1.2.2"}